Курс_Бухгалтерские_задачи/src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.Серии</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Курс_Бухгалтерские_задачи/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Бухгалтерский</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаХолдинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Курс_Бухгалтерские_задачи/src/ChartsOfAccounts/Бухгалтерский/Бухгалтерский.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Бухгалтерский</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>1</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>1.1</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>1.2</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>1.3</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>2</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>2.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>2.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>3</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>СчетАналитикаПереоценки</name>
      <description>Счет аналитика переоценки</description>
      <code>4</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ТоварыНаХранении</name>
      <description>Товары на хранении</description>
      <code>6</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Курс_Бухгалтерские_задачи/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ОсновныеСредства</types>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Субконто</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.СтатьиДДС</types>
  </type>
  <predefined>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>СтатьиДДС</name>
      <description>Статьи ДДС</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Курс_Бухгалтерские_задачи/src/Documents/ПродажаТоваров/ObjectModule.bsl
Процедура ОбработкаПроведенияПервая(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Проводки 
	Движения.Проводки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Товары;
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Номенклатура", ТекСтрокаТовары.Номенклатура);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Склады", Склад);
		Движение.КоличествоКт = ТекСтрокаТовары.Количество;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Стоимость;
		Движение.Содержание = "продажа товаров";
		Движение.Организация = Организация;
		БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);
		
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели;
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Договоры", Договор);
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Содержание = "продажа товаров";
		Движение.Организация = Организация;
		БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);
	КонецЦикла;
	
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели;
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Договоры", Договор);
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
		Движение.Содержание = "продажа услуг";
		Движение.Организация = Организация;
		БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);
	КонецЦикла;
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаПроведенияВторая(Отказ, Режим)
	
	ПВХ = ПланыВидовХарактеристик.ВидыСубконто;

	движения.Проводки.Записать();

	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	ВидыСубконтоНС = Новый Массив;
	ВидыСубконтоНС.Добавить(ПВХ.Номенклатура); //1
	ВидыСубконтоНС.Добавить(ПВХ.Склады); //2
	Запрос.УстановитьПараметр("ВидыСубконтоНС", ВидыСубконтоНС);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажаТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПродажаТоваровТовары.Количество,
	|	ПродажаТоваровТовары.Сумма,
	|	ПродажаТоваровТовары.НомерСтроки
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
	|ГДЕ
	|	ПродажаТоваровТовары.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура
	|ИЗ
	|	Товары КАК Товары";

	Результат = Запрос.Выполнить();

	Блокировка = Новый БлокировкаДанных;
	ЭлементБД = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
	ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.Товары);
	ЭлементБД.УстановитьЗначение("Организация", Организация);
	ЭлементБД.УстановитьЗначение("Подразделение", Подразделение);
	ЭлементБД.УстановитьЗначение(ПВХ.Склады, Склад);
	ЭлементБД.ИсточникДанных = Результат;
	ЭлементБД.ИспользоватьИзИсточникаДанных(ПВХ.Номенклатура, "Номенклатура");
	ЭлементБД.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();	

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроводкиОстатки.Субконто1 КАК Субконто1,
	|	ПроводкиОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПроводкиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Остатки(
	|			&Период,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары),
	|			&ВидыСубконтоНС,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И Субконто1 В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)) КАК ПроводкиОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроводкиОстатки.Субконто1 КАК Субконто1,
	|	ПроводкиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиПоСкладу
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Остатки(
	|			&Период,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары),
	|			&ВидыСубконтоНС,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И Субконто2 = &Склад
	|				И Субконто1 В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)) КАК ПроводкиОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК ОстСум,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК ОстКол,
	|	ЕСТЬNULL(ОстаткиПоСкладу.КоличествоОстаток, 0) КАК ОстКолСклад
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО Товары.Номенклатура = Остатки.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСкладу КАК ОстаткиПоСкладу
	|		ПО Товары.Номенклатура = ОстаткиПоСкладу.Субконто1";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Движения.Проводки.Записывать = Истина;

	Пока Выборка.Следующий() Цикл
		Стоимость = 0;
		Если Выборка.ОстКолСклад < Выборка.Количество Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Товары не хватает";
			Сообщение.Поле = "Товары["+(Выборка.НомерСтроки-1)+"].Количество";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить(); 
			Отказ = Истина;
		Иначе
			Стоимость = ОКР(Выборка.ОстСум*Выборка.Количество/Выборка.ОстКол, 2);
		КонецЕсли;

		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели;
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт,Движение.СубконтоДт,"Контрагенты",Контрагент);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт,Движение.СубконтоДт,"Договоры",Договор);
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.Сумма;
		Движение.Содержание = "продажа";
		Движение.Организация = Организация;
		БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Товары;
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт,Движение.СубконтоКт,"Номенклатура",Выборка.Номенклатура);		
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт,Движение.СубконтоКт,"Склады",Склад);
		Движение.Период = Дата;
		Движение.Сумма = Стоимость;
		Движение.КоличествоКт = Выборка.Количество;
		Движение.Содержание = "стоимость";
		Движение.Организация = Организация;
		БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

Движения.Проводки.Записывать = Истина;

Движения.Проводки.БлокироватьДляИзменения = Истина;

Для Каждого ТекСтрокаТовары Из Товары Цикл
	Движение = Движения.Проводки.Добавить();
	Движение.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели;
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Договоры", Договор);
	Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;
	Движение.Период = Дата;
	Движение.Сумма = ТекСтрокаТовары.Сумма;
	Движение.Содержание = "продажа товара";
	Движение.Организация = Организация;
	БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	Движение = Движения.Проводки.Добавить();
	Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
	Движение.СчетКт = ПланыСчетов.Бухгалтерский.Товары;
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Номенклатура", ТекСтрокаТовары.Номенклатура);
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Склады", Склад);
	Движение.Период = Дата;
	Движение.Сумма = 0; //или плановая
	движение.КоличествоКт = ТекСтрокаТовары.Количество;
	Движение.Содержание = "стоимость";
	Движение.Организация = Организация;
	БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);
КонецЦикла;

Движения.Проводки.Записать();

Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ПродажаТоваровТовары.Номенклатура
|ПОМЕСТИТЬ Товары
|ИЗ
|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПроводкиОстатки.Субконто1
|ИЗ
|	РегистрБухгалтерии.Проводки.Остатки(
|			&Период,
|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары),
|			&ВидыСубконто,
|			Организация = &Организация
|				И Подразделение = &Подразделение
|				И Субконто2 = &Склад
|				И Субконто1 В
|					(ВЫБРАТЬ
|						Товары.Номенклатура
|					ИЗ
|						Товары КАК Товары)) КАК ПроводкиОстатки
|ГДЕ
|	ПроводкиОстатки.КоличествоОстаток < 0";
Запрос.УстановитьПараметр("Период", Неопределено);
ПВХ = ПланыВидовХарактеристик.ВидыСубконто;
ВидыСубконто = Новый Массив;
ВидыСубконто.Добавить(ПВХ.Номенклатура);
ВидыСубконто.Добавить(ПВХ.Склады);
Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
Запрос.УстановитьПараметр("Организация", Организация);
Запрос.УстановитьПараметр("Подразделение", Подразделение);
Запрос.УстановитьПараметр("Склад", Склад);

Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
Отбор = Новый Структура("Номенклатура", Выборка.Субконто1);
мСтрок = Товары.НайтиСтроки(Отбор);
Для каждого Стр Из мСтрок Цикл
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Не хватило товара "+Строка(Выборка.Субконто1);
	Сообщение.Поле = "Товары["+(Стр.НомерСтроки-1)+"].Количество";
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить(); 
	Отказ = Истина;
КонецЦикла; 
КонецЦикла;

КонецПроцедуры
